EnmanuelParache/msp430fr247x/msp430fr2475.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>P3</name>
      <description>P3</description>
      <baseAddress>544</baseAddress>
      <registers>
        <register>
          <name>P3IN</name>
          <description>Port 3 Input</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P3OUT</name>
          <description>Port 3 Output</description>
          <addressOffset>2</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P3DIR</name>
          <description>Port 3 Direction</description>
          <addressOffset>4</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P3REN</name>
          <description>Port 3 Resistor Enable</description>
          <addressOffset>6</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P3SEL0</name>
          <description>Port 3 Select 0</description>
          <addressOffset>10</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P3SEL1</name>
          <description>Port 3 Select 1</description>
          <addressOffset>12</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P3SELC</name>
          <description>Port 3 Complement Select</description>
          <addressOffset>22</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P3IES</name>
          <description>Port 3 Interrupt Edge Select</description>
          <addressOffset>24</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P3IE</name>
          <description>Port 3 Interrupt Enable</description>
          <addressOffset>26</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P3IFG</name>
          <description>Port 3 Interrupt Flag</description>
          <addressOffset>28</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P3IV</name>
          <description>Port 3 Interrupt Vector Register</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>P3IV</name>
              <description>Port 3 interrupt vector value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3IFG0</name>
                  <description>Interrupt Source: Port 3.0 interrupt; Interrupt Flag: P3IFG0; Interrupt Priority: Highest</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3IFG1</name>
                  <description>Interrupt Source: Port 3.1 interrupt; Interrupt Flag: P3IFG1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3IFG2</name>
                  <description>Interrupt Source: Port 3.2 interrupt; Interrupt Flag: P3IFG2</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3IFG3</name>
                  <description>Interrupt Source: Port 3.3 interrupt; Interrupt Flag: P3IFG3</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3IFG4</name>
                  <description>Interrupt Source: Port 3.4 interrupt; Interrupt Flag: P3IFG4</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3IFG5</name>
                  <description>Interrupt Source: Port 3.5 interrupt; Interrupt Flag: P3IFG5</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3IFG6</name>
                  <description>Interrupt Source: Port 3.6 interrupt; Interrupt Flag: P3IFG6</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P3IFG7</name>
                  <description>Interrupt Source: Port 3.7 interrupt; Interrupt Flag: P3IFG7; Interrupt Priority: Lowest</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>P4</name>
      <description>P4</description>
      <baseAddress>544</baseAddress>
      <registers>
        <register>
          <name>P4IN</name>
          <description>Port 4 Input</description>
          <addressOffset>1</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P4OUT</name>
          <description>Port 4 Output</description>
          <addressOffset>3</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P4DIR</name>
          <description>Port 4 Direction</description>
          <addressOffset>5</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P4REN</name>
          <description>Port 4 Resistor Enable</description>
          <addressOffset>7</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P4SEL0</name>
          <description>Port 4 Select 0</description>
          <addressOffset>11</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P4SEL1</name>
          <description>Port 4 Select 1</description>
          <addressOffset>13</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P4SELC</name>
          <description>Port 4 Complement Select</description>
          <addressOffset>23</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P4IES</name>
          <description>Port 4 Interrupt Edge Select</description>
          <addressOffset>25</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P4IE</name>
          <description>Port 4 Interrupt Enable</description>
          <addressOffset>27</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P4IFG</name>
          <description>Port 4 Interrupt Flag</description>
          <addressOffset>29</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>P4IV</name>
          <description>Port 4 Interrupt Vector Register</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>P4IV</name>
              <description>Port 4 interrupt vector value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P4IFG0</name>
                  <description>Interrupt Source: Port 4.0 interrupt; Interrupt Flag: P4IFG0; Interrupt Priority: Highest</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P4IFG1</name>
                  <description>Interrupt Source: Port 4.1 interrupt; Interrupt Flag: P4IFG1</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P4IFG2</name>
                  <description>Interrupt Source: Port 4.2 interrupt; Interrupt Flag: P4IFG2</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P4IFG3</name>
                  <description>Interrupt Source: Port 4.3 interrupt; Interrupt Flag: P4IFG3</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P4IFG4</name>
                  <description>Interrupt Source: Port 4.4 interrupt; Interrupt Flag: P4IFG4</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P4IFG5</name>
                  <description>Interrupt Source: Port 4.5 interrupt; Interrupt Flag: P4IFG5</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P4IFG6</name>
                  <description>Interrupt Source: Port 4.6 interrupt; Interrupt Flag: P4IFG6</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>P4IFG7</name>
                  <description>Interrupt Source: Port 4.7 interrupt; Interrupt Flag: P4IFG7; Interrupt Priority: Lowest</description>
                  <value>16</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
