EnmanuelParache/msp430fr247x/msp430fr2475.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYS</name>
      <description>SYS</description>
      <baseAddress>320</baseAddress>
      <registers>
        <register>
          <name>SYSCTL</name>
          <description>System Control</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>SYSRIVECT</name>
              <description>RAM-based interrupt vectors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRAM</name>
                  <description>Interrupt vectors generated with end address TOP of lower 64K FRAM FFFFh</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM</name>
                  <description>Interrupt vectors generated with end address TOP of RAM, when RAM available</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSPMMPE</name>
              <description>PMM access protect</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Access from anywhere in memory</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Access only from the BSL segments</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSBSLIND</name>
              <description>BSL entry indication</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLR</name>
                  <description>No BSL entry sequence detected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SET</name>
                  <description>BSL entry sequence detected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSJTAGPIN</name>
              <description>Dedicated JTAG pins enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SHARED</name>
                  <description>Shared JTAG pins (JTAG mode selectable using SBW sequence)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DEDICATED</name>
                  <description>Dedicated JTAG pins (explicit 4-wire JTAG mode selection)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSBSLC</name>
          <description>Bootloader Configuration</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>SYSBSLR</name>
              <description>RAM assigned to BSL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORAM</name>
                  <description>No RAM assigned to BSL area</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAM</name>
                  <description>Lowest 16 bytes of RAM assigned to BSL</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSBSLOFF</name>
              <description>Bootstrap loader memory disable for the size covered in SYSBSLSIZE</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ON</name>
                  <description>BSL memory is addressed when this area is read.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>BSL memory behaves like vacant memory. Reads cause 3FFFh to be read. Fetches cause JMP $ to be executed.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYSBSLPE</name>
              <description>Bootstrap loader memory protection enable for the size covered in SYSBSLSIZE. By default, this bit is cleared by hardware with a BOR event (as indicated above); however, the boot code that checks for an available BSL may set this bit in software to protect the BSL. Because devices normally come with a TI BSL preprogrammed and protected, the boot code sets this bit.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOTPROT</name>
                  <description>Area not protected. Read, program, and erase of BSL memory is possible.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PROT</name>
                  <description>Area protected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSJMBC</name>
          <description>JTAG Mailbox Control</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>JMBIN0FG</name>
              <description>Incoming JTAG Mailbox 0 flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NODAT</name>
                  <description>JMBI0 has no new data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEWDAT</name>
                  <description>JMBI0 has new data available</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JMBIN1FG</name>
              <description>Incoming JTAG Mailbox 1 flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NODAT</name>
                  <description>JMBI1 has no new data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NEWDAT</name>
                  <description>JMBI1 has new data available</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JMBOUT0FG</name>
              <description>Outgoing JTAG Mailbox 0 flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>JMBO0 is not ready to receive new data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY</name>
                  <description>JMBO0 is ready to receive new data</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JMBOUT1FG</name>
              <description>Outgoing JTAG Mailbox 1 flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>JMBO1 is not ready to receive new data</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>READY</name>
                  <description>JMBO1 is ready to receive new data</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JMBMODE</name>
              <description>Operation mode of JMB</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>16BIT</name>
                  <description>16-bit transfers using JMBO0 and JMBI0 only</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32BIT</name>
                  <description>32-bit transfers using JMBO0 with JMBO1 and JMBI0 with JMBI1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JMBCLR0OFF</name>
              <description>Incoming JTAG Mailbox 0 flag auto-clear disable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRORD</name>
                  <description>JMBIN0FG cleared on read of JMB0IN register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRBSW</name>
                  <description>JMBIN0FG cleared by software</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>JMBCLR1OFF</name>
              <description>Incoming JTAG Mailbox 1 flag auto-clear disable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLRORD</name>
                  <description>JMBIN1FG cleared on read of JMB1IN register</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLRBSW</name>
                  <description>JMBIN1FG cleared by software</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSJMBI0</name>
          <description>JTAG Mailbox Input 0</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>MSGLO</name>
              <description>JTAG mailbox incoming message low byte</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MSGHI</name>
              <description>JTAG mailbox incoming message high byte</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSJMBI1</name>
          <description>JTAG Mailbox Input 1</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>MSGLO</name>
              <description>JTAG mailbox incoming message low byte</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MSGHI</name>
              <description>JTAG mailbox incoming message high byte</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSJMBO0</name>
          <description>JTAG Mailbox Output 0</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>MSGLO</name>
              <description>JTAG mailbox outgoing message low byte</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSGHI</name>
              <description>JTAG mailbox outgoing message high byte</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSJMBO1</name>
          <description>JTAG Mailbox Output 1</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>MSGLO</name>
              <description>JTAG mailbox outgoing message low byte</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSGHI</name>
              <description>JTAG mailbox outgoing message high byte</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSUNIV</name>
          <description>User NMI Vector Generator</description>
          <addressOffset>26</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>SYSUNIV</name>
              <description>User NMI vector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NMIIFG</name>
                  <description>NMIFG NMI pin or SVSH event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFIFG</name>
                  <description>OFIFG oscillator fault</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSSNIV</name>
          <description>System NMI Vector Generator</description>
          <addressOffset>28</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>SYSSNIV</name>
              <description>System NMI vector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>SYSSNIV</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSLIFG</name>
                  <description>SVS low-power reset entry</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UBDIFG</name>
                  <description>Uncorrectable FRAM bit error detection</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCTEIFG</name>
                  <description>FRAM Access Time Error</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSSNIV_8</name>
                  <description>Reserved</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSSNIV_10</name>
                  <description>Reserved</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSSNIV_12</name>
                  <description>Reserved</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSSNIV_14</name>
                  <description>Reserved</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSSNIV_16</name>
                  <description>Reserved</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VMAIFG</name>
                  <description>VMAIFG Vacant memory access</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JMBINIFG</name>
                  <description>JMBINIFG JTAG mailbox input</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>JMBOUTIFG</name>
                  <description>JMBOUTIFG JTAG mailbox output</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBDIFG</name>
                  <description>Correctable FRAM bit error detection</description>
                  <value>24</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
