EnmanuelParache/msp430fr247x/msp430fr2475.svd
        <register>
          <name>SYSRSTIV</name>
          <description>Reset Vector Generator</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>SYSRSTIV</name>
              <description>Reset interrupt vector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOR</name>
                  <description>Brownout</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSTNMI</name>
                  <description>RSTIFG RST/NMI</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMSWBOR</name>
                  <description>PMMSWBOR software BOR</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM5WU</name>
                  <description>LPMx.5 wakeup</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECYV</name>
                  <description>Security violation</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSRSTIV_12</name>
                  <description>Reserved</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSHIFG</name>
                  <description>SVSHIFG SVSH event</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSRSTIV_16</name>
                  <description>Reserved</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSRSTIV_18</name>
                  <description>Reserved</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMSWPOR</name>
                  <description>PMMSWPOR software POR</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIFG</name>
                  <description>WDTIFG watchdog timeout</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTPW</name>
                  <description>WDTPW watchdog password violation</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRCTLPW</name>
                  <description>FRCTLPW password violation</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UBDIFG</name>
                  <description>Uncorrectable FRAM bit error detection</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERF</name>
                  <description>Peripheral area fetch</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMPW</name>
                  <description>PMM password violation</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSRSTIV_34</name>
                  <description>Reserved</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLUL</name>
                  <description>FLL unlock (PUC)</description>
                  <value>36</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG0</name>
          <description>System Configuration 0</description>
          <addressOffset>32</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>PFWP</name>
              <description>Program FRAM write protection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WEN</name>
                  <description>Program FRAM write enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WPROT</name>
                  <description>Program FRAM write protected (not writable)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRWPPW</name>
              <description>FRWPPW password.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFWP</name>
              <description>Data FRAM write protection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WEN</name>
                  <description>Data FRAM write enable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WPROT</name>
                  <description>Data FRAM write protected (not writable)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRWPOA</name>
              <description>Program FRAM write protection offset address from the beginning of Program FRAM. The offset increases by 1KB resolution</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG1</name>
          <description>System Configuration 1</description>
          <addressOffset>34</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>IREN</name>
              <description>Infrared enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIS</name>
                  <description>Infrared function disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EN</name>
                  <description>Infrared function enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRPSEL</name>
              <description>Infrared polarity select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORM</name>
                  <description>Normal polarity</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INV</name>
                  <description>Inverted polarity</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRMSEL</name>
              <description>Infrared mode select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ASK</name>
                  <description>ASK mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSK</name>
                  <description>FSK mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRDSSEL</name>
              <description>Infrared data source select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HW</name>
                  <description>From hardware peripherals upon device configuration</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IRDATA</name>
                  <description>From IRDATA bit</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IRDATA</name>
              <description>Infrared data</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Infrared data logic 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Infrared data logic 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SYNCSEL</name>
              <description>Captivate Conversion triggered Source Selection</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SYNCSEL_0</name>
                  <description>External source is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCSEL_1</name>
                  <description>ADC as the source is selected</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCSEL_2</name>
                  <description>Comparator as the source is selected</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNCSEL_3</name>
                  <description>Reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG2</name>
          <description>System Configuration 2</description>
          <addressOffset>36</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>RTCCKSEL</name>
              <description>RTC clock selection</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTCCKSEL_0</name>
                  <description>SMCLK is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCCKSEL_1</name>
                  <description>ACLK is selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USCIB0RMP</name>
              <description>eUSCI_B0 remapping source selection</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USCIB0RMP_0</name>
                  <description>Default function. See the device-specific data sheet for details.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USCIB0RMP_1</name>
                  <description>Remapped function. See the device-specific data sheet for details.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TB0TRGSEL</name>
              <description>TB0OUTH trigger source selection</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TB0TRGSEL_0</name>
                  <description>Internal source is selected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TB0TRGSEL_1</name>
                  <description>External source is selected</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG3</name>
          <description>System Configuration 3</description>
          <addressOffset>38</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>USCIA0RMP</name>
              <description>eUSCI_A0 remapping source selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USCIA0RMP_0</name>
                  <description>Default function. See the device-specific data sheet for details.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USCIA0RMP_1</name>
                  <description>Remapped function. See the device-specific data sheet for details.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TA2RMP</name>
              <description>Timer2_A3 remapping source selection</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TA2RMP_0</name>
                  <description>Default function. See the device-specific data sheet for details.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TA2RMP_1</name>
                  <description>Remapped function. See the device-specific data sheet for details.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TA3RMP</name>
              <description>Timer3_A3 remapping source selection</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TA3RMP_0</name>
                  <description>Default function. See the device-specific data sheet for details.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TA3RMP_1</name>
                  <description>Remapped function. See the device-specific data sheet for details.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USCIB1RMP</name>
              <description>eUSCI_B1 remapping source selection</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>USCIB1RMP_0</name>
                  <description>Default function. See the device-specific data sheet for details.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USCIB1RMP_1</name>
                  <description>Remapped function. See the device-specific data sheet for details.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
