EnmanuelParache/msp430fr247x/msp430fr2475.svd
        <register>
          <name>CSCTL6</name>
          <description>Clock System Control 6</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>XT1AUTOOFF</name>
              <description>XT1 automatic off enable. This bit allows XT1 turned turns off when it is not used</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XT1AUTOOFF_0</name>
                  <description>XT1 is on if XT1 is selected by the port selection and XT1 is not in bypass mode of operation.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1AUTOOFF_1</name>
                  <description>XT1 is off if it is not used as a source for ACLK, MCLK, or SMCLK or is not used as a reference source required for FLL operation.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XT1AGCOFF</name>
              <description>Automatic Gain Control (AGC) disable.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XT1AGCOFF_0</name>
                  <description>AGC on</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1AGCOFF_1</name>
                  <description>AGC off</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XT1HFFREQ</name>
              <description>The XT1 High-frequency selection. These bits must be set to appropriate frequency for crystal or bypass modes of operation.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XT1HFFREQ_0</name>
                  <description>1 to 4 MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1HFFREQ_1</name>
                  <description>4 MHz to 6 MHz</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1HFFREQ_2</name>
                  <description>6 MHz to 16 MHz</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1HFFREQ_3</name>
                  <description>16 MHz to 24 MHz</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XT1BYPASS</name>
              <description>XT1 bypass select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XT1BYPASS_0</name>
                  <description>XT1 source internally</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1BYPASS_1</name>
                  <description>XT1 sources externally from pin</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XTS</name>
              <description>XT1 mode select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XTS_0</name>
                  <description>Low-frequency mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XTS_1</name>
                  <description>High-frequency mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XT1DRIVE</name>
              <description>The XT1 oscillator current can be adjusted to its drive needs. Initially, it starts with the highest supply current for reliable and quick startup. If needed, user software can reduce the drive strength. The configuration of these bits is retained during LPM3.5 until LOCKLPM5 is cleared, but not the register bits itself; therefore, reconfiguration after wake-up from LPM3.5 before clearing LOCKLPM5 is required.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XT1DRIVE_0</name>
                  <description>Lowest drive strength and current consumption</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1DRIVE_1</name>
                  <description>Lower drive strength and current consumption</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1DRIVE_2</name>
                  <description>Higher drive strength and current consumption</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1DRIVE_3</name>
                  <description>Highest drive strength and current consumption</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVA</name>
              <description>ACLK source divider.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>/1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>/16</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>/32</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>/64</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>/128</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <description>/256</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>384</name>
                  <description>/384</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512</name>
                  <description>/512</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>768</name>
                  <description>/768(Only available in 24MHz clock system, 24 MHz preference)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024</name>
                  <description>/1024(Only available in 24MHz clock system, 24 MHz preference)</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>108</name>
                  <description>/108(Only available in 24MHz clock system, 24 MHz preference)</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>338</name>
                  <description>338(Only available in 24MHz clock system, 24 MHz preference)</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>414</name>
                  <description>414(Only available in 24MHz clock system, 24 MHz preference)</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>640</name>
                  <description>640(Only available in 24MHz clock system, 24 MHz preference)</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVA_14</name>
                  <description>Reserved</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVA_15</name>
                  <description>Reserved</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XT1FAULTOFF</name>
              <description>The XT1 oscillator fault detection off</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XT1FAULTOFF_0</name>
                  <description>Enabling XT1 fault to switch ACLK to REFO</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1FAULTOFF_1</name>
                  <description>Disabling XT1 fault to switch ACLK to REFO</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSCTL7</name>
          <description>Clock System Control Register 7</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>REFOREADY</name>
              <description>REFO ready flag. This bit reflects the REFO readiness whent REFO is good for operation (such as FLL reference)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFOREADY_0</name>
                  <description>REFO unstable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFOREADY_1</name>
                  <description>REFO ready to go</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCOFFG</name>
              <description>DCO fault flag. If this bit is set, the OFIFG flag is also set. The DCOFFG bit is set if DCO = {0} or DCO = {511}. DCOFFG can be cleared by software. If the DCO fault condition still remains, DCOFFG is set. As long as DCOFFG is set, FLLUNLOCK shows the DCOERROR condition.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCOFFG_0</name>
                  <description>No fault condition occurred after the last reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFFG_1</name>
                  <description>DCO fault. A DCO fault occurred after the last reset.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XT1OFFG</name>
              <description>T1 oscillator fault flag. If this bit is set, the OFIFG flag is also set. XT1OFFG is set if a XT1 fault condition exists. XT1OFFG can be cleared by software. If the XT1 fault condition still remains, XT1OFFG is set.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XT1OFFG_0</name>
                  <description>No fault condition occurred after the last reset.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1OFFG_1</name>
                  <description>XT1 fault. An XT1 fault occurred after the last reset.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLLULIFG</name>
              <description>FLL unlock interrupt flag. This flag is set when FLLUNLOCK bits equal 10b (DCO too fast). If FLLULPUC is also set, a PUC is triggered when FLLUIFG is set.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLLULIFG_0</name>
                  <description>FLLUNLOCK bits not equal to 10b</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLULIFG_1</name>
                  <description>FLLUNLOCK bits equal to 10b</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ENSTFCNT1</name>
              <description>Enable start counter for XT1.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ENSTFCNT1_0</name>
                  <description>Startup fault counter disabled. Counter is cleared..</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENSTFCNT1_1</name>
                  <description>Startup fault counter enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLLUNLOCK</name>
              <description>Unlock. These bits indicate the current FLL unlock condition. These bits are both set as long as the DCOFFG flag is set.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLLUNLOCK_0</name>
                  <description>FLL is locked. No unlock condition currently active.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLUNLOCK_1</name>
                  <description>DCOCLK is currently too slow.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLUNLOCK_2</name>
                  <description>DCOCLK is currently too fast.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLUNLOCK_3</name>
                  <description>DCOERROR. DCO out of range.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLLUNLOCKHIS</name>
              <description>Unlock history bits. These bits indicate the FLL unlock condition history. As soon as any unlock condition happens, the respective bits are set and remain set until cleared by software by writing 0 to it or by a POR.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLLUNLOCKHIS_0</name>
                  <description>FLL is locked. No unlock situation has been detected since the last reset of these bits.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLUNLOCKHIS_1</name>
                  <description>DCOCLK has been too slow since the bits were cleared.</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLUNLOCKHIS_2</name>
                  <description>DCOCLK has been too fast since the bits were cleared.</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLUNLOCKHIS_3</name>
                  <description>DCOCLK has been both too fast and too slow since the bits were cleared.</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLLULPUC</name>
              <description>FLL unlock PUC enable. If the FLLULPUC bit is set, a reset (PUC) is triggered if FLLULIFG is set. FLLULIFG indicates when FLLUNLOCK bits equal 10 (too fast). FLLULPUC is automatically cleared upon servicing the event. If FLLULPUC is cleared (0), no PUC can be triggered by FLLULIFG.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLWARNEN</name>
              <description>Warning enable. If this bit is set, an interrupt is generated based on the FLLUNLOCKHIS bits. If FLLUNLOCKHIS is not equal to 00, an OFIFG is generated.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLLWARNEN_0</name>
                  <description>FLLUNLOCKHIS status cannot set OFIFG.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLWARNEN_1</name>
                  <description>FLLUNLOCKHIS status can set OFIFG.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSCTL8</name>
          <description>Clock System Control Register 8</description>
          <addressOffset>16</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ACLKREQEN</name>
              <description>ACLK clock request enable. Setting this enables conditional module requests for ACLK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACLKREQEN_0</name>
                  <description>ACLK conditional requests are disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLKREQEN_1</name>
                  <description>ACLK conditional requests are enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCLKREQEN</name>
              <description>MCLK clock request enable. Setting this enables conditional module requests for MCLK</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MCLKREQEN_0</name>
                  <description>MCLK conditional requests are disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCLKREQEN_1</name>
                  <description>MCLK conditional requests are enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMCLKREQEN</name>
              <description>SMCLK clock request enable. Setting this enables conditional module requests for SMCLK</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SMCLKREQEN_0</name>
                  <description>SMCLK conditional requests are disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMCLKREQEN_1</name>
                  <description>SMCLK conditional requests are enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MODOSCREQEN</name>
              <description>MODOSC clock request enable. Setting this enables conditional module requests for MODOSC.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MODOSCREQEN_0</name>
                  <description>MODOSC conditional requests are disabled.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MODOSCREQEN_1</name>
                  <description>MODOSC conditional requests are enabled.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
