EnmanuelParache/msp430fr247x/msp430fr2475.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FRCTL</name>
      <description>FRCTL</description>
      <baseAddress>416</baseAddress>
      <registers>
        <register>
          <name>FRCTL0</name>
          <description>FRAM Controller Control Register 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>NWAITS</name>
              <description>Wait state numbers</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NWAITS_0</name>
                  <description>FRAM wait states: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_1</name>
                  <description>FRAM wait states: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_2</name>
                  <description>FRAM wait states: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_3</name>
                  <description>FRAM wait states: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_4</name>
                  <description>FRAM wait states: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_5</name>
                  <description>FRAM wait states: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_6</name>
                  <description>FRAM wait states: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_7</name>
                  <description>FRAM wait states: 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRCTLPW</name>
              <description>FRCTLPW password</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GCCTL0</name>
          <description>General Control Register 0</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UBDRSTEN</name>
              <description>Enable Power Up Clear (PUC) reset for the uncorrectable bit error detection flag (UBDIFG)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UBDRSTEN_0</name>
                  <description>PUC not initiated on uncorrectable bit error detection flag.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UBDRSTEN_1</name>
                  <description>PUC initiated on uncorrectable bit error detection flag. Generates vector in SYSRSTIV. Clear the UBDIE bit.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UBDIE</name>
              <description>Enable NMI event for the uncorrectable bit error detection flag (UBDIFG)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UBDIE_0</name>
                  <description>Disable NMI for the uncorrectable bit error detection flag (UBDIFG).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UBDIE_1</name>
                  <description>Enable NMI for the uncorrectable bit error detection flag (UBDIFG). Generates vector in SYSSNIV. Clear the UBDRSTEN bit.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBDIE</name>
              <description>Enable NMI event for the correctable bit error detection flag (CBDIFG)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBDIE_0</name>
                  <description>Disable NMI for the correctable bit error detection flag (CBDIFG).</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBDIE_1</name>
                  <description>Disable NMI for the correctable bit error detection flag (CBDIFG). Generates vector in SYSSNIV.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRPWR</name>
              <description>FRAM Memory Power Control Request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRPWR_0</name>
                  <description>Enable INACTIVE mode.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRPWR_1</name>
                  <description>Enable ACTIVE mode.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRLPMPWR</name>
              <description>Enables FRAM auto power up after LPM</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FRLPMPWR_0</name>
                  <description>FRAM startup is delayed to the first FRAM access after exit from LPM</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRLPMPWR_1</name>
                  <description>FRAM is powered up immediately on exit from LPM</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>GCCTL1</name>
          <description>General Control Register 1</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ACCTEIFG</name>
              <description>Access time error flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ACCTEIFG_0</name>
                  <description>No interrupt pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACCTEIFG_1</name>
                  <description>Interrupt pending. Can be cleared by writing '0' or by reading SYSSNIV when it is the highest pending interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UBDIFG</name>
              <description>FRAM uncorrectable bit error detection flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UBDIFG_0</name>
                  <description>No interrupt pending.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UBDIFG_1</name>
                  <description>Interrupt pending. Can be cleared by writing '0' or by reading SYSSNIV when it is the highest pending interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CBDIFG</name>
              <description>FRAM correctable bit error detection flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CBDIFG_0</name>
                  <description>No interrupt is pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBDIFG_1</name>
                  <description>Interrupt pending. Can be cleared by writing '0' or by reading SYSSNIV if it is the highest pending interrupt.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
