EnmanuelParache/msp430fr247x/msp430fr2475.svd
        <register>
          <name>TA3IV</name>
          <description>TimerAx Interrupt Vector Register</description>
          <addressOffset>46</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>TAIV</name>
              <description>TimerA interrupt vector value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TACCR1</name>
                  <description>Interrupt Source: Capture/compare 1; Interrupt Flag: TAxCCR1 CCIFG; Interrupt Priority: Highest</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TACCR2</name>
                  <description>Interrupt Source: Capture/compare 2; Interrupt Flag: TAxCCR2 CCIFG</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TACCR3</name>
                  <description>Interrupt Source: Capture/compare 3; Interrupt Flag: TAxCCR3 CCIFG</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TACCR4</name>
                  <description>Interrupt Source: Capture/compare 4; Interrupt Flag: TAxCCR4 CCIFG</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TACCR5</name>
                  <description>Interrupt Source: Capture/compare 5; Interrupt Flag: TAxCCR5 CCIFG</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TACCR6</name>
                  <description>Interrupt Source: Capture/compare 6; Interrupt Flag: TAxCCR6 CCIFG</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TAIFG</name>
                  <description>Interrupt Source: Timer overflow; Interrupt Flag: TAxCTL TAIFG; Interrupt Priority: Lowest</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>TB0</name>
      <description>TB0</description>
      <baseAddress>1152</baseAddress>
      <registers>
        <register>
          <name>TB0CTL</name>
          <description>Timer_B Control Register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>TBIFG</name>
              <description>TimerB interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TBIFG_0</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIFG_1</name>
                  <description>Interrupt pending</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBIE</name>
              <description>TimerB interrupt enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TBIE_0</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIE_1</name>
                  <description>Interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBCLR</name>
              <description>TimerB clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MC</name>
              <description>Mode control</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>STOP</name>
                  <description>Stop mode: Timer is halted</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UP</name>
                  <description>Up mode: Timer counts up to TBxCL0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONTINUOUS</name>
                  <description>Continuous mode: Timer counts up to the value set by CNTL</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UPDOWN</name>
                  <description>Up/down mode: Timer counts up to TBxCL0 then down to 0000h</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID</name>
              <description>Input divider</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>1</name>
                  <description>/1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2</name>
                  <description>/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4</name>
                  <description>/4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>/8</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBSSEL</name>
              <description>TimerB clock source select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TBCLK</name>
                  <description>TBxCLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLK</name>
                  <description>ACLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SMCLK</name>
                  <description>SMCLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INCLK</name>
                  <description>INCLK</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CNTL</name>
              <description>Counter length</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>16</name>
                  <description>16-bit, TBxR(max) = 0FFFFh</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12</name>
                  <description>12-bit, TBxR(max) = 0FFFh</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10</name>
                  <description>10-bit, TBxR(max) = 03FFh</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8</name>
                  <description>8-bit, TBxR(max) = 0FFh</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TBCLGRP</name>
              <description>TBxCLn group</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TBCLGRP_0</name>
                  <description>Each TBxCLn latch loads independently</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCLGRP_1</name>
                  <description>TBxCL1+TBxCL2 (TBxCCR1 CLLD bits control the update); TBxCL3+TBxCL4 (TBxCCR3 CLLD bits control the update); TBxCL5+TBxCL6 (TBxCCR5 CLLD bits control the update); TBxCL0 independent</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCLGRP_2</name>
                  <description>TBxCL1+TBxCL2+TBxCL3 (TBxCCR1 CLLD bits control the update); TBxCL4+TBxCL5+TBxCL6 (TBxCCR4 CLLD bits control the update); TBxCL0 independent</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBCLGRP_3</name>
                  <description>TBxCL0+TBxCL1+TBxCL2+TBxCL3+TBxCL4+TBxCL5+TBxCL6 (TBxCCR1 CLLD bits control the update)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TB0CCTL0</name>
          <description>Timer_B Capture/Compare Control Register</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CCIFG</name>
              <description>Capture/compare interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIFG_0</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIFG_1</name>
                  <description>Interrupt pending</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COV</name>
              <description>Capture overflow</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COV_0</name>
                  <description>No capture overflow occurred</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COV_1</name>
                  <description>Capture overflow occurred</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUT</name>
              <description>Output</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOW</name>
                  <description>Output low</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HIGH</name>
                  <description>Output high</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCI</name>
              <description>Capture/compare input</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CCIE</name>
              <description>Capture/compare interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIE_0</name>
                  <description>Interrupt disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIE_1</name>
                  <description>Interrupt enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OUTMOD</name>
              <description>Output mode</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTMOD_0</name>
                  <description>OUT bit value</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_1</name>
                  <description>Set</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_2</name>
                  <description>Toggle/reset</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_3</name>
                  <description>Set/reset</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_4</name>
                  <description>Toggle</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_5</name>
                  <description>Reset</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_6</name>
                  <description>Toggle/set</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_7</name>
                  <description>Reset/set</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP</name>
              <description>Capture mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>COMPARE</name>
                  <description>Compare mode</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CAPTURE</name>
                  <description>Capture mode</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLLD</name>
              <description>Compare latch load</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLLD_0</name>
                  <description>TBxCLn loads on write to TBxCCRn</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_1</name>
                  <description>TBxCLn loads when TBxR counts to 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_2</name>
                  <description>TBxCLn loads when TBxR counts to 0 (up or continuous mode). TBxCLn loads when TBxR counts to TBxCL0 or to 0 (up/down mode).</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_3</name>
                  <description>TBxCLn loads when TBxR counts to TBxCLn</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCS</name>
              <description>Synchronize capture source</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ASYNC</name>
                  <description>Asynchronous capture</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYNC</name>
                  <description>Synchronous capture</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CCIS</name>
              <description>Capture/compare input select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIA</name>
                  <description>CCIxA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIB</name>
                  <description>CCIxB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GND</name>
                  <description>GND</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VCC</name>
                  <description>VCC</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM</name>
              <description>Capture mode</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No capture</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISING</name>
                  <description>Capture on rising edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FALLING</name>
                  <description>Capture on falling edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOTH</name>
                  <description>Capture on both rising and falling edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
