EnmanuelParache/msp430fr247x/msp430fr2475.svd
        <register>
          <name>CP0DACDATA</name>
          <description>6-bit Comparator built-in DAC Data Register</description>
          <addressOffset>18</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CPDACBUF1</name>
              <description>1st 6-bit DAC buffer Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPDACBUF1_0</name>
                  <description>0v</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_1</name>
                  <description>selected reference voltage * 1/64</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_2</name>
                  <description>selected reference voltage * 2/64</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_3</name>
                  <description>selected reference voltage * 3/64</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_4</name>
                  <description>selected reference voltage * 4/64</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_5</name>
                  <description>selected reference voltage * 5/64</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_6</name>
                  <description>selected reference voltage * 6/64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_7</name>
                  <description>selected reference voltage * 7/64</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_8</name>
                  <description>selected reference voltage * 8/64</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_9</name>
                  <description>selected reference voltage *9/64</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_10</name>
                  <description>selected reference voltage * 10/64</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_11</name>
                  <description>selected reference voltage * 11/64</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_12</name>
                  <description>selected reference voltage * 12/64</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_13</name>
                  <description>selected reference voltage * 13/64</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_14</name>
                  <description>selected reference voltage * 14/64</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_15</name>
                  <description>selected reference voltage * 15/64</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_16</name>
                  <description>selected reference voltage * 16/64</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_17</name>
                  <description>selected reference voltage * 17/64</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_18</name>
                  <description>selected reference voltage * 18/64</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_19</name>
                  <description>selected reference voltage * 19/64</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_20</name>
                  <description>selected reference voltage * 20/64</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_21</name>
                  <description>selected reference voltage * 21/64</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_22</name>
                  <description>selected reference voltage * 22/64</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_23</name>
                  <description>selected reference voltage * 23/64</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_24</name>
                  <description>selected reference voltage * 24/64</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_25</name>
                  <description>selected reference voltage * 25/64</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_26</name>
                  <description>selected reference voltage * 26/64</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_27</name>
                  <description>selected reference voltage * 27/64</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_28</name>
                  <description>selected reference voltage * 28/64</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_29</name>
                  <description>selected reference voltage * 29/64</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_30</name>
                  <description>selected reference voltage * 30/64</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_31</name>
                  <description>selected reference voltage * 31/64</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_32</name>
                  <description>selected reference voltage * 32/64</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_33</name>
                  <description>selected reference voltage * 33/64</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_34</name>
                  <description>selected reference voltage * 34/64</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_35</name>
                  <description>selected reference voltage * 35/64</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_36</name>
                  <description>selected reference voltage * 36/64</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_37</name>
                  <description>selected reference voltage * 37/64</description>
                  <value>37</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_38</name>
                  <description>selected reference voltage * 38/64</description>
                  <value>38</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_39</name>
                  <description>selected reference voltage * 39/64</description>
                  <value>39</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_40</name>
                  <description>selected reference voltage * 40/64</description>
                  <value>40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_41</name>
                  <description>selected reference voltage * 41/64</description>
                  <value>41</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_42</name>
                  <description>selected reference voltage * 42/64</description>
                  <value>42</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_43</name>
                  <description>selected reference voltage * 43/64</description>
                  <value>43</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_44</name>
                  <description>selected reference voltage * 44/64</description>
                  <value>44</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_45</name>
                  <description>selected reference voltage * 45/64</description>
                  <value>45</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_46</name>
                  <description>selected reference voltage * 46/64</description>
                  <value>46</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_47</name>
                  <description>selected reference voltage * 47/64</description>
                  <value>47</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_48</name>
                  <description>selected reference voltage * 48/64</description>
                  <value>48</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_49</name>
                  <description>selected reference voltage * 49/64</description>
                  <value>49</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_50</name>
                  <description>selected reference voltage * 50/64</description>
                  <value>50</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_51</name>
                  <description>selected reference voltage * 51/64</description>
                  <value>51</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_52</name>
                  <description>selected reference voltage * 52/64</description>
                  <value>52</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_53</name>
                  <description>selected reference voltage * 53/64</description>
                  <value>53</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_54</name>
                  <description>selected reference voltage * 54/64</description>
                  <value>54</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_55</name>
                  <description>selected reference voltage * 55/64</description>
                  <value>55</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_56</name>
                  <description>selected reference voltage * 56/64</description>
                  <value>56</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_57</name>
                  <description>selected reference voltage * 57/64</description>
                  <value>57</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_58</name>
                  <description>selected reference voltage * 58/64</description>
                  <value>58</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_59</name>
                  <description>selected reference voltage * 59/64</description>
                  <value>59</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_60</name>
                  <description>selected reference voltage * 60/64</description>
                  <value>60</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_61</name>
                  <description>selected reference voltage * 61/64</description>
                  <value>61</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_62</name>
                  <description>selected reference voltage * 62/64</description>
                  <value>62</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF1_63</name>
                  <description>selected reference voltage * 63/64</description>
                  <value>63</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CPDACBUF2</name>
              <description>2nd 6-bit DAC buffer Data</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CPDACBUF2_0</name>
                  <description>0v</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_1</name>
                  <description>selected reference voltage * 1/64</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_2</name>
                  <description>selected reference voltage * 2/64</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_3</name>
                  <description>selected reference voltage * 3/64</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_4</name>
                  <description>selected reference voltage * 4/64</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_5</name>
                  <description>selected reference voltage * 5/64</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_6</name>
                  <description>selected reference voltage * 6/64</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_7</name>
                  <description>selected reference voltage * 7/64</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_8</name>
                  <description>selected reference voltage * 8/64</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_9</name>
                  <description>selected reference voltage * 9/64</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_10</name>
                  <description>selected reference voltage * 10/64</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_11</name>
                  <description>selected reference voltage * 11/64</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_12</name>
                  <description>selected reference voltage * 12/64</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_13</name>
                  <description>selected reference voltage * 13/64</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_14</name>
                  <description>selected reference voltage * 14/64</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_15</name>
                  <description>selected reference voltage * 15/64</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_16</name>
                  <description>selected reference voltage * 16/64</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_17</name>
                  <description>selected reference voltage * 17/64</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_18</name>
                  <description>selected reference voltage * 18/64</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_19</name>
                  <description>selected reference voltage * 19/64</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_20</name>
                  <description>selected reference voltage * 20/64</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_21</name>
                  <description>selected reference voltage * 21/64</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_22</name>
                  <description>selected reference voltage * 22/64</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_23</name>
                  <description>selected reference voltage * 23/64</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_24</name>
                  <description>selected reference voltage * 24/64</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_25</name>
                  <description>selected reference voltage * 25/64</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_26</name>
                  <description>selected reference voltage * 26/64</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_27</name>
                  <description>selected reference voltage * 27/64</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_28</name>
                  <description>selected reference voltage * 28/64</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_29</name>
                  <description>selected reference voltage * 29/64</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_30</name>
                  <description>selected reference voltage * 30/64</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_31</name>
                  <description>selected reference voltage * 31/64</description>
                  <value>31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_32</name>
                  <description>selected reference voltage * 32/64</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_33</name>
                  <description>selected reference voltage * 33/64</description>
                  <value>33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_34</name>
                  <description>selected reference voltage * 34/64</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_35</name>
                  <description>selected reference voltage * 35/64</description>
                  <value>35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_36</name>
                  <description>selected reference voltage * 36/64</description>
                  <value>36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPDACBUF2_37</name>
